
&НаКлиенте
Процедура Отправить(Команда)
	ОтправитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСервере()
//	СоединениеКафка = Кафка.НовоеОписаниеСоединения("http://localhost:8082", "json");
//	Отправитель = Кафка.НовыйОтправитель(СоединениеКафка);
//	Кафка.ДобавитьСообщение(Отправитель, Текст, "1c.topic");
//	Кафка.ОтправитьСообщения(Отправитель);	
	
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/vnd.kafka.json.v2+json");
	Заголовки.Вставить("Accept", "*/*");
	
	HTTPСоединение = Новый HTTPСоединение("localhost", 8082);
	HTTPЗапрос = Новый HTTPЗапрос("/topics/1c.topic", Заголовки);
	
	Сообщение = Новый Структура("value", Текст);
	
	МассивЗначений = Новый Массив;
	МассивЗначений.Добавить(Сообщение);
	
	Запись = Новый Структура;
	Запись.Вставить("records", МассивЗначений);
	
	JSONТекст = КоннекторHTTP.ОбъектВJson(Запись);
	
	HTTPЗапрос.УстановитьТелоИзСтроки(JSONТекст);
	
	Результат = HTTPСоединение.ВызватьHTTPМетод("POST", HTTPЗапрос);
	
	Ответ = Результат.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
	
КонецПроцедуры

&НаКлиенте
Процедура Получить(Команда)
	ПолучитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьНаСервере()
	Ответ = "";
	
	СоединениеКафка = Кафка.НовоеОписаниеСоединения("http://localhost:8082", "json");
	Подписчик = Кафка.НовыйПодписчик(СоединениеКафка, "ConsumerGroup1C", , Истина, 100);

	Кафка.ЗарегистрироватьПодписчика(Подписчик);
	Кафка.Подписаться(Подписчик, "1c.topic");
	Сообщения = Кафка.ПолучитьСообщения(Подписчик);
	Для Каждого Сообщение Из Сообщения Цикл
		Ответ = Ответ+Символы.ПС+Сообщение.Получить("value");
	КонецЦикла;

	Кафка.УдалитьПодисчика(Подписчик);
КонецПроцедуры