
&НаКлиенте
Процедура Отправить(Команда)
	ОтправитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСервере()
	СоединениеКафка = Кафка.НовоеОписаниеСоединения(Адрес, "json");
	Отправитель = Кафка.НовыйОтправитель(СоединениеКафка);
	Кафка.ДобавитьСообщение(Отправитель, Текст, "1c.topic");
	Кафка.ОтправитьСообщения(Отправитель);	
КонецПроцедуры

&НаКлиенте
Процедура Получить(Команда)
	ПолучитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьНаСервере()
	Ответ = "";
	
	СоединениеКафка = Кафка.НовоеОписаниеСоединения(Адрес, "json");
	Подписчик = Кафка.НовыйПодписчик(СоединениеКафка, "ConsumerGroup1C", , Истина, 100);

	Кафка.ЗарегистрироватьПодписчика(Подписчик);
	Кафка.Подписаться(Подписчик, "1c.topic");
	Сообщения = Кафка.ПолучитьСообщения(Подписчик);
	Для Каждого Сообщение Из Сообщения Цикл
		Ответ = Ответ+Символы.ПС+Сообщение.Получить("value");
	КонецЦикла;

	Кафка.УдалитьПодисчика(Подписчик);
КонецПроцедуры